Repository: lukkam1998/driving_school_app_public
Catalog: lib/l10n/intl_*.arb
Languages: pl

# language
source: en
pl: pl

source: Create Account
pl: Stwórz konto

source: Welcome!
pl: Witaj!

# emailhint
source: E-mail address
pl: Adres e-mail

# passwordhint
source: Password
pl: Hasło

# passwordhintrepeat
source: Repeat password
pl: Powtórz hasło

source: Sign in
pl: Zaloguj się

# donthaveacc
source: Don't have account?
pl: Nie masz konta?

# have_acc
source: Have account?
pl: Masz konto?

source: Sign up
pl: Zarejestruj się

source: or...
pl: lub...

source: Continue with google
pl: Kontynuuj z google

source: Lessons
pl: Lekcje

source: Messages
pl: Wiadomości

source: Offer
pl: Oferta

# singupSuccessed
source: Your account is created!
pl: Twoje konto zostało założone!

# signupFailed
source: Error appeared during signin up :(
pl: Wystąpił błąd podczas rejestracji :(

# empty_string_value
source: This field cannot be empty
pl: To pole nie może być puste

# wrong_repeated_password
source: Passwords must be the same
pl: Hasła muszą być takie same

# finish_configuration
source: Finish account configuration
pl: Dokończ konfiguracje konta

source: Name
pl: Imię

source: Surname
pl: Nazwisko

# add_avatar
source: Add your avatar
pl: Dodaj avatar

source: Confirm
pl: Potwierdź

source: Birth date
pl: Data urodzin

# successful_update
source: Your data has been updated!
pl: Twoje dane zostały zaktualizowane!

# see_offer
source: Check our offer!
pl: Sprawdź naszą ofertę!

source: Your courses
pl: Twoje kursy

source: Your rides
pl: Twoje jazdy

# enroll_course
source: Enroll in the course
pl: Zapisz się na kurs

source: Our offer
pl: Nasza oferta

# categorie
source: Category
pl: Kategoria

source: Price
pl: Cena

source: Duration
pl: Długość

# min_age
source: Minimum age
pl: Minimalny wiek

# want_to_enroll
source: I want to enroll
pl: Chcę się zapisać

# confirm_course_dialog
source: Are you sure you want to enroll to the course for categorie {category}?
pl: Jesteś pewien że chcesz się zapisać na kurs kategorii {category}?

# enroll_succeed
source: You have been enrolled! Wait for confirmation
pl: Zostałeś zapisany! Zaczekaj na potwierdzenie

# enroll_failure
source: Sorry we couldn't enroll you, try again
pl: Przepraszamy, coś poszło nie tak, spróbuj ponownie

source: Try again
pl: Spróbuj ponownie

source: Close
pl: Zamknij

# already_enrolled
source: You have already enrolled to that course!
pl: Jesteś już zapisany na ten kurs!

# didnt_enroll_yet
source: You didn't enroll on any course yet
pl: Nie zapisałeś się na żaden kurs

# wait_for_confirmation
source: Waiting for confirmation
pl: Oczekuje na zatwierdzenie

# confirmed_go_to_lessons
source: Confirmed, go to lessons to plan your lessons
pl: Potwierdzony, przejdź do lekcji aby zaplanować jazdy

source: Choose student
pl: Wybierz kursanta

source: Date of enroll
pl: Data zapisu

# student_taken
source: You've taken course!
pl: Wziałeś kurs!

source: Resign
pl: Zrezygnuj

# couldnt_load_lessons
source: Sorry, we couldn't load lessons
pl: Przepraszamy nie mogliśmy załadować lekcji

# dont_have_lessons_this_day
source: You don't have lessons this day
pl: Nie masz zaplanowanych lekcji tego dnia

# didnt_have_lessons_this_day
source: You did not have any lesson this day
pl: Nie miałeś żadnych jazd tego dnia

# plan_lesson
source: Plan a lesson
pl: Zaplanuj lekcje

# didnt_enroll_to_any_course
source: You haven't enroll to any course yet!
pl: Nie zapisałeś się na żaden kurs!

source: Plan lesson on
pl: Planujesz lekcje w dniu

source: Choose start hour
pl: Wybierz godzine rozpoczęcia

source: Choose end hour
pl: Wybierz godzine zakończenia

source: Your tutor
pl: Twój instruktor

source: Selected day
pl: Wybrany dzień

source: Driving hours
pl: Jazdy w godzinach

# wait_for_confirmation_from_instructor
source: Waiting for confirmation from instructor
pl: Czeka na zatwierdzenie przez instruktora

# confirmed_by_instr
source: Confirmed by instructor
pl: Potwierdzona przez instruktora

# has_took_place
source: Took place
pl: Odbyła się

# hasnt_took_place
source: Have not took place
pl: Nie odbyła się

source: Send message
pl: Wyślij wiadomość

source: Promotion
pl: Promocja

source: Start lesson
pl: Rozpocznij lekcje

source: Cancel lesson
pl: Anuluj lekcje

source: Modify lesson
pl: Modifikuj lekcje

source: Cancel
pl: Anuluj

source: Cars
pl: Auta

source: Trainees
pl: Kursanci

# acc_manager
source: Account manager
pl: Menedżer kont

# trainees_preview
source: Trainee preview
pl: Podgląd kursantów

source: Instructors preview
pl: Podgląd instruktorów

# users_info
source: Information about users
pl: Informacje o użytkownikach

source: Add car
pl: Dodaj auto

source: Manage car
pl: Zarządzaj autem

source: Update
pl: Zaktualizuj

source: Pucharse date
pl: Data zakupu

source: Last review
pl: Ostatni przegląd

source: Last oil change
pl: Ostatnia zmiana oleju

source: KM done
pl: Przebieg

# do_you_want_remove_car
source: Do you want to remove car
pl: Chcesz usunąć auto

# dont_have_any_contacts
source: You don't have any contacts
pl: Nie masz żadnych kontaktów

source: Search contacts
pl: Szukaj kontaktów

source: Search by surname
pl: Szukaj po nazwisku

source: Search
pl: Szukaj

source: No users found
pl: Nie znaleziono użytkowników

# tutor
source: Instructor
pl: Instruktor

source: Apprentice
pl: Uczeń

source: Owner
pl: Właściciel

# add_contact_succed
source: Contact added succesfully
pl: Pomyślnie dodano kontakt

source: Create instructor account
pl: Stwórz konta instruktora

# live_courses
source: On going courses
pl: Trwające kursy

source: Add course
pl: Dodaj kurs

source: Category
pl: Kategoria

source: Required age
pl: Wymagany wiek

source: Add
pl: Dodaj

# adding_course_failed
source: Failed to add course try again
pl: Dodawanie kursu się nie powiodło spróbuj ponownie

# adding_succed
source: Adding course succed
pl: Pomyślnie dodano kurs

# modify_course_failed
source: Failed to modify course try again
pl: Modyfikowanie kursu nie powiodło się

# modify_succed
source: Modifying course succed
pl: Pomyślnie modyfikowano kurs

source: Modify
pl: Modifikuj

source: Course is available
pl: Kurs jest dostępny

# course_is_not_available
source: Course isn't available
pl: Kurs nie jest dostępny

source: Change availability of course
pl: Zmień dostępność kursu

source: Trainee
pl: Kursant

source: Hours
pl: Godziny

source: Closest lesson
pl: Najbliższa lekcja

source: End lesson
pl: Zakończ lekcje

source: Lesson has took place
pl: Lekcja się odbyła

# lesson_started
source: Lesson has started
pl: Lekcja się rozpoczeła

source: Lesson ended with
pl: Zakończ lekcje z

source: Start lesson with
pl: Rozpocznij lekcje z

source: Lesson started at
pl: Lekcja rozpoczeła się o

source: Lesson ended at
pl: Lekcja zakończyła się o

# no_lesson_planned_with
source: No lessons were planned for this day with {userName}, do you want to plan it?
pl: Nie zaplanowałeś/zatwierdziłeś lekcji z {userName}, chcesz ją zaplanować?

# tracking_is_live
source: Drive tracking is live...
pl: Zapisywanie lokalizacji...

source: No live lessons
pl: Brak trwających lekcji

source: Promotions
pl: Promocje

# account_created_successfully
source: Account was created successfully
pl: Konto zostało utworzone

# error_couldnt_create_acc
source: Error occured, couldn't create account
pl: Wystąpił błąd, nie udało się stworzyć konta

# no_users
source: No users to show
pl: Brak użytkowników

source: Wrong credentials
pl: Podałeś złe dane

# account_doesnt_exist
source: This account does not exist
pl: Podane konto nie istnieje

# error_during_getting_user_course_data
source: Unexpected error during fetching user course data
pl: Wystąpił błąd podczas pobierania danych użytkownika

# user_didnt_enroll_to_any_course
source: User did not enroll to any course
pl: Użytkownik nie jest zapisany na żaden kurs

# tutor_dont_run_any_course
source: Instructor do not drive any course
pl: Instruktor nie prowadzi żadnego kursu

source: Settings
pl: Ustawienia

source: Sign out
pl: Wyloguj się

source: Manage courses
pl: Zarządzaj kursami

source: Your lessons
pl: Twoje lekcje

source: Take course
pl: Weź kurs

# failed_getting_promotions
source: Error occured during getting promotions
pl: Wystąpił błąd podczas ładowania promocji

source: Show expired promotions
pl: Pokaż zakończone promocje

source: Description
pl: Opis

source: Value
pl: Wartość

# successfully_added_promotion
source: Promotion added succesfully
pl: Pomyślnie dodano promocje

# failed_to_add_promotion
source: Error occured during adding promotion
pl: Wystąpił błąd podczas dodawania promocji

source: Add promotion
pl: Dodaj promocje

source: Choose course
pl: Wybierz kurs

# choose_eng_promotion_image
source: Choose english version image
pl: Wybierz zdjęcie promocyjne dla wersji angielskiej

# choose_pl_promotion_image
source: Choose polish version image
pl: Wybierz zdjęcie promocyjne dla wersji polskiej

# amount_of_promotion
source: Amount of promotion in %
pl: Ilość promocji w %

source: Provide valid number
pl: Podaj poprawny numer

source: Choose expiry date
pl: Data wygaśniecia promocji

source: Expiry date
pl: Data wygaśniecia

# change_eng_promotion_image
source: Change english version image
pl: Zmień zdjęcie promocyjne dla wersji angielskiej

# change_pl_promotion_image
source: Change polish version image
pl: Zmień zdjęcie promocyjne dla wersji angielskiej

source: Error, try again
pl: Wystąpił błąd, spróbuj ponownie

source: Successfully edited promotion
pl: Pomyślnie edytowano promocje

# you_save
source: You are saving
pl: Oszczędzasz

source: Buy more hours
pl: Dokup godziny

source: Modified confirm
pl: Zmodyfikowano, potwierdź

# check_the_ride
source: Check route
pl: Sprawdź trasę

# your_ride
source: Your route
pl: Twoja trasa

source: No
pl: Nie

source: Yes
pl: Tak

source: Sorry, error occured
pl: Przepraszamy, wystąpił błąd

# choose_hours_amount_to_pucharse
source: How many hours you want to buy ?
pl: Ile godzin chcesz dokupić?

source: Hours bought succesfully
pl: Godziny zostały kupione!

# dont_run_any_courses
source: You don't run any courses
pl: Nie prowadzisz żadnych kursów

source: Course Ended
pl: Kurs zakończony

source: Check rides
pl: Sprawdź jazdy

source: No students
pl: Brak kursantów

# email_already_in_use
source: This email is already in use.
pl: Ten email jest już używany.

# invalid_email
source: Address email is not valid
pl: Adres email jest niepoprawny

# weak_password
source: Use stronger password
pl: Twoje hasło jest za słabe

source: Invalid credentials
pl: Nieprawidłowe dane

source: Wrong password
pl: Złe hasło

source: Couldn't add lesson
pl: Nie można dodać lekcji

# promotion_is_already_running
source: This course has already promotion
pl: Ten kurs ma juz promocje

# no_promotions_running
source: No promotions now :(
pl: Brak promocji : (

# we_couldnt_load_promotions_swipe_to_try_again
source: Sorry, we could not load promotions, swipe down to try again
pl: Nie mogliśmy załadować promocji, przeciągnij w dół aby spróbować ponownie

# blocked_location_forever
source: Location is blocked forever, go to settings to let app see your location
pl: Lokalizacja została zablokowana, przejdź do ustawień i nadaj odpowiednie uprawnienia

# lessons_added_successfully
source: Lesson added successfully
pl: Lekcja dodana pomyślnie

# adding_lesson_failed
source: Failed to add lesson
pl: Wystąpił błąd podczas dodawania lekcji

source: Pick date
pl: Wybierz date

# last_oil_change_date
source: Last oil change
pl: Data ostatniej wymiany oleju

source: Last car review
pl: Ostatni przegląd auta

source: Car mark
pl: Marka auta

source: Car model
pl: Model auta

# car_registration
source: Registration number
pl: Numer rejestracji

source: Date of pucharse
pl: Data zakupu
